//
//  MSQ_100.cpp
//  msq_convert
//
//  Created by Michael T. Lauter on 3/10/13.
//
//  Roland MSQ-100 System Exclusive Sequencer Data
//  class
//


#include <stdio.h>
//#include <iomanip>
#include <string.h>
#include <cmath>

#include "AppConfig.h"
#include "MSQ_100.h"
#include "juce_MathsFunctions.h"


// Exclusive Message for MSQ-100 sequencer data
typedef union
{
    uint8_t raw[264];
    struct MSQ_SysEx_Hdr
    {
        uint8_t ex_status;    // 0xF0
        uint8_t man_id;       // 0x41 for Roland
        uint8_t funct_type;   // 0x57
        uint8_t data_type;    // 0x70 for 7-8 conversion
        uint8_t message_num;  // 0 - 127
    } field;
} msq100_sysex_hdr;

//
typedef union
{
    uint8_t raw[40];
    struct Q1_FCB
    {
        uint8_t header;        // 0xFD
        uint8_t block_type;    // 'F'
        uint8_t data_type[2];  // 'Q1'
        uint8_t file_name[30]; // 'MSQ-100.0                     ' 21 spaces
        uint8_t conductor_sw;  // 0x00 - off
        uint8_t track_num;     // 0x00 - none?
        uint8_t phrase_num[2]; // 0x01, 0x00
        uint8_t time_base;     // 0x78 - timebase = 120 PPQN
        uint8_t tempo;         // 0x64 - 100, but has no function
        uint8_t EOB[2];        // 0xFE, 0xFE
    } field;
} q1_file_ctrl_block;


typedef union
{
    uint8_t raw[4];
    struct Q1_PD_block_header
    {
        uint8_t header;        // 0xFD
        uint8_t block_type;    // 'P'
        uint8_t phrase_id[2];  // 0x00, 0x00
        // uint8_t EOB[2];
    } field;
} q1_phrase_block_hdr;


// In studying MSQ SysEx files, I hae found this is End Block is never sent.
// However, it is defined in the Roland specs.
/*
typedef union
{
    uint8_t raw[6];
    struct Q1_ED
    {
        uint8_t header;        // 0xFD
        uint8_t block_type;    // 'E'
        uint8_t data_type[2];  // 0x00, 0x00 (dummy)
        uint8_t EOB[2];        // 0xFE, 0xFE
    } field;
} q1_end_block;
 */

typedef union
{
    uint8_t raw[4];
    struct Q1_PD
    {
        uint8_t time;
        uint8_t midi_status;  //
        uint8_t key_num;
        uint8_t vel;   // only if status in 0xC0 - 0xDF
    } midi_voice;
    
} q1_phrase_data;





//
static const unsigned char msq_fcb_header[] =
{
    0xFD, 'F', 'Q', '1', 'M', 'S', 'Q', '-',
    '1', '0', '0', '.', '0', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ',
    ' ', ' ', 0x01, 0x00, 0x78, 0x64, 0xFE, 0xFE
};



MSQ_100_SysEx::MSQ_100_SysEx()
{
    valid_Q1_data = FALSE;
    raw_sysex = FALSE;
    standard_midi = FALSE;
    num_syx_blks = 0;
    q1_data_size = 0;
    full_q1_data = new uint8_t[128*256];
}


MSQ_100_SysEx::~MSQ_100_SysEx()
{
    delete full_q1_data;
}


bool MSQ_100_SysEx::isRawSysEx()
{
    return (raw_sysex);
}


// check is we have MSQ SysEx data
bool MSQ_100_SysEx::validate_MSQ()
{
